load-test/test.yaml
config:
  target: http://localhost:8080/api/v1
  phases:
  - name: Create conversations
    duration: 300
    arrivalRate: 5
    maxVusers: 50
  environments:
    dev:
      target: https://nks-bob-api.ansatt.dev.nav.no/api/v1
  defaults:
    headers:
      nav-call-id: load-test-call-id
      # authorization: "{{ $env.TOKEN }}"
      cookie: "{{ $env.COOKIE }}"
  processor: "./flows.js"
scenarios:
  - flow:
    - function: "createConversation"
    - post:
        url: "/conversations"
        json: "{{ data }}"
        capture:
          json: "$.id"
          as: conversationId
  # - engine: ws
  #   flow:
  #     - connect:
  #         target: "ws://localhost:8080/api/v1/conversation/{{ conversationId }}/messages/ws"
  #     - function: "createMessage"
  #     - send: "{{ data }}"